Revit 2027 API
PipeLossMethodType Enumeration
An enumerated type listing all pipe loss method types for a connector
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum PipeLossMethodType
Public Enumeration PipeLossMethodType
public enum class PipeLossMethodType
type PipeLossMethodType
Members
Member name | Value | Description
Coefficient | 6 | pipe loss method depend on coefficient.
NotDefined | 0 | pipe loss method is undefined.
SpecificLoss | 4 | pipe loss method is specified.
Table | 1 | pipe loss method is depend on the coefficient from table.
See Also
Reference
Autodesk.Revit.DB.Plumbing Namespace